var province = [{
    "id": "01",
    "name": "1号线",
    "color":"#63BE19",
    "deepercolor":"#448c18",
    "city": [{"id": "0140", "name": "木渎"}, {"id": "0141", "name": "金枫路"}, {"id": "0142", "name": "汾湖路"}, {
        "id": "0143",
        "name": "玉山路"
    }, {"id": "0144", "name": "苏州乐园"}, {"id": "0145", "name": "塔园路"}, {"id": "0146", "name": "滨河路"}, {
        "id": "0147",
        "name": "西环路"
    }, {"id": "0148", "name": "桐泾北路"}, {"id": "s1|0149", "name": "广济南路"}, {
        "id": "0150",
        "name": "养育巷"
    }, {"id": "s3|0151", "name": "乐桥"}, {"id": "0152", "name": "临顿路"}, {"id": "0153", "name": "相门"}, {
        "id": "0154",
        "name": "东环路"
    }, {"id": "0155", "name": "中央公园"}, {"id": "0156", "name": "星海广场"}, {"id": "0157", "name": "东方之门"}, {
        "id": "0158",
        "name": "文化博览中心"
    }, {"id": "0159", "name": "时代广场"}, {"id": "0160", "name": "星湖街"}, {"id": "0161", "name": "南施街"}, {
        "id": "0162",
        "name": "星塘街"
    }, {"id": "0163", "name": "钟南街"}]
}, {
    "id": "02",
    "name": "2号线",
    "color":"#FE0000",
    "deepercolor":"#8c0000",
    "city": [{"id": "0238", "name": "骑河"}, {"id": "0239", "name": "富翔路"}, {
        "id": "0240",
        "name": "高铁苏州北站"
    }, {"id": "0241", "name": "大湾"}, {"id": "0242", "name": "富元路"}, {"id": "0243", "name": "蠡口"}, {
        "id": "0244",
        "name": "徐图港"
    }, {"id": "0245", "name": "阳澄湖中路"}, {"id": "0246", "name": "陆慕"}, {"id": "0247", "name": "平泷路东"}, {
        "id": "0248",
        "name": "平河路"
    }, {"id": "s2|0249", "name": "苏州火车站"}, {"id": "0250", "name": "山塘街"}, {
        "id": "0251",
        "name": "石路"
    }, {"id": "s1|0252", "name": "广济南路"}, {"id": "0253", "name": "三香广场"}, {"id": "0254", "name": "劳动路"}, {
        "id": "0255",
        "name": "胥江路"
    }, {"id": "0256", "name": "桐泾公园"}, {"id": "0257", "name": "友联"}, {"id": "0258", "name": "盘蠡路"}, {
        "id": "0259",
        "name": "新家桥"
    }, {"id": "s4|0260", "name": "石湖东路"}, {"id": "0261", "name": "宝带桥南"}, {"id": "0262", "name": "尹中路"}, {
        "id": "0263",
        "name": "郭巷"
    }, {"id": "0264", "name": "郭苑路"}, {"id": "0265", "name": "尹山湖"}, {"id": "0266", "name": "独墅湖南"}, {
        "id": "0267",
        "name": "独墅湖邻里中心"
    }, {"id": "0268", "name": "月亮湾"}, {"id": "0269", "name": "松涛街"}, {"id": "0270", "name": "金谷路"}, {
        "id": "0271",
        "name": "金尚路"
    }, {"id": "0272", "name": "桑田岛"}]
}, {
    "id": "03",
    "name": "4号线",
    "color":"#0077D5",
    "deepercolor":"#005187",
    "city": [{"id": "0430", "name": "龙道浜"}, {"id": "0431", "name": "张庄"}, {"id": "0432", "name": "姚祥"}, {
        "id": "0433",
        "name": "活力岛"
    }, {"id": "0434", "name": "孙武纪念园"}, {"id": "0435", "name": "平泷路西"}, {"id": "0436", "name": "苏锦"}, {
        "id": "s2|0437",
        "name": "苏州火车站"
    }, {"id": "0438", "name": "北寺塔"}, {"id": "0439", "name": "察院场"}, {"id": "s3|0440", "name": "乐桥"}, {
        "id": "0441",
        "name": "三元坊"
    }, {"id": "0442", "name": "南门"}, {"id": "0443", "name": "人民桥南"}, {"id": "0444", "name": "团结桥"}, {
        "id": "0445",
        "name": "宝带路"
    }, {"id": "s4|0446", "name": "石湖东路"}, {"id": "s5|0447", "name": "红庄"}, {"id": "0448", "name": "淸树湾"}, {
        "id": "0449",
        "name": "花港"
    }, {"id": "0450", "name": "江陵西路"}, {"id": "0451", "name": "江兴西路"}, {"id": "0452", "name": "流虹路"}, {
        "id": "0453",
        "name": "笠泽路"
    }, {"id": "0454", "name": "顾家荡"}, {"id": "0455", "name": "苏州湾东"}, {"id": "0456", "name": "松陵大道"}, {
        "id": "0457",
        "name": "吴江人民广场"
    }, {"id": "0458", "name": "吴江汽车站"}, {"id": "0459", "name": "庞金路"}, {"id": "0460", "name": "同里"}]
}, {
    "id": "07",
    "name": "4号线支线",
    "color":"#0077D5",
    "deepercolor":"#005187",
    "city": [{"id": "s5|0729", "name": "红庄"}, {"id": "0730", "name": "蠡墅"}, {
        "id": "0731",
        "name": "石湖莫舍"
    }, {"id": "0732", "name": "越溪"}, {"id": "0733", "name": "文溪路"}, {"id": "0734", "name": "天鹅荡路"}, {
        "id": "0735",
        "name": "苏州湾北"
    }, {"id": "0736", "name": "木里"}]
}]
